app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"

  def create
    @pessoa = Pessoa.new(pessoa_params)

    if @pessoa.save
---
INSERT INTO "pessoas" ("nome", "email", "cidade", "telefone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "string"], ["email", "string"], ["cidade", "string"], ["telefone", "string"], ["created_at", "2019-11-06 12:03:31.140944"], ["updated_at", "2019-11-06 12:03:31.140944"]]

  def destroy
    @pessoa.destroy
---
DELETE FROM "pessoas" WHERE "pessoas"."id" = $1  [["id", 980190962]]

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]