app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "teste231@gma.com"], ["LIMIT", 1]]
---
  def create
    user = User
               .find_by(email: params["user"]["email"])
               .try(:authenticate,params["user"]["password"])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def set_current_user
    if session[:user_id]
      @current_user = User.find(session[:user_id])